package sql_java;

public class sql_inert {
    public static void main(String[] args) {
        mysqlConnection Insert = new mysqlConnection();
        //  여기 복붙하기.
        String name[] = {"권나길","윤나라우람","추다운","임힘찬","안빛가람","성버들","정믿음","제갈샘","황빛가람","정버들","최한결","탁한결","문다운","양미르","홍나라우람","강힘찬","황보으뜸","오힘찬","한믿음","류다운","강으뜸","서빛가람","문다운","한나라우람","한한결","봉미르","조한길","한나길","사공믿음","황나길", "임다정","류민성","최소정","권미진","손성수","문형욱","탁민혜","장윤옥","강은성","풍준영","신해남","박연석","권병지","유종남","양승태","유정은","손용하","신도혁","사공명수","송윤민","허민준","임준수","유영주","서승근","정은옥","배상미","하형욱","조재정","손혜준","설원주", "봉무영","임무영","조무영","설현승","유강민","백동건","풍재범","백승헌","오철순","정철순","송이수","노이수","문오성","유경구","전치원","손동건","임경모","봉병헌","박광조","한일성","정무영","봉동건","이요한","류승헌","복강민","표경택","황강민","조치원","강경구","홍경택", "배숙자","박재인","이재인","류영애","유남순","남애정","박영신","조혜림","황보혜림","한민서","이민서","박유리","황나영","예혜린","박유리","신나영","손혜림","추은채","양재신","추자경","임민서","백재인","배혜림","탁숙자","안경완","오은채","심혜린","사공여진","유혜린","한민서"};
        String department [] = {"한국", "미국", "중국", "일본"};
        int cnt = 0;
        for(int i=0; i<5000; i++){

           int age_random = (int) (Math.random()*90+10);
           int department_random = (int) (Math.random()*department.length);

           Insert.insert(name[cnt], age_random, department[department_random]);

           System.out.printf("INSERT INTO employee VALUES(NULL, '%s', %d, '%s');\n", name[cnt], age_random, department[department_random]);
           cnt++;
           if(cnt >= name.length) {
               cnt = 0;
           }
       }
    }
}